In [1]:
import datetime
import pandas as pd
import numpy as np

In [2]:
np.zeros([3,1]).T

array([[0., 0., 0.]])

In [3]:
now = datetime.datetime.now()
a = np.zeros([4,3])
b = np.array([now,5,8])
a = pd.DataFrame(a,columns=['a','b','c'])
b = pd.DataFrame(np.atleast_2d(b),columns=['a','b','c'])
c = pd.DataFrame(np.atleast_2d([now,*[12,13]]),columns=['a','b','c'])

In [4]:
c

                           a   b   c
0 2023-05-02 16:20:13.862126  12  13

In [5]:
b

                           a  b  c
0 2023-05-02 16:20:13.862126  5  8

In [6]:
tot = pd.concat([a,b,c],ignore_index=True)

In [7]:
tot

                            a    b    c
0                         0.0  0.0  0.0
1                         0.0  0.0  0.0
2                         0.0  0.0  0.0
3                         0.0  0.0  0.0
4  2023-05-02 16:20:13.862126    5    8
5  2023-05-02 16:20:13.862126   12   13

In [8]:
tot = tot.iloc[0:0]

In [9]:
tot

Empty DataFrame
Columns: [a, b, c]
Index: []

In [10]:
tot = pd.concat([b,c],ignore_index=True)
tot

                           a   b   c
0 2023-05-02 16:20:13.862126   5   8
1 2023-05-02 16:20:13.862126  12  13

In [11]:
vals = tot[['b','c']]
vals

    b   c
0   5   8
1  12  13

In [12]:
tot['b'].mean()

8.5

In [13]:
vals.mean().values

array([ 8.5, 10.5])

In [20]:
columns = ['as','buka','vedi']
df = pd.DataFrame(np.atleast_2d([10,20,10]),columns=columns)

In [21]:
df

   as  buka  vedi
0  10    20    10

In [22]:
di = {'wor':3,'mar':0.4}
list(di)

['wor', 'mar']

In [25]:
b.join(df)

                           a  b  c  as  buka  vedi
0 2023-05-02 16:20:13.862126  5  8  10    20    10

In [36]:
a = pd.DataFrame(np.zeros([100,10]))

In [47]:
a.iloc[-3:][3].mean()

0.0

In [50]:
type(a[2])

pandas.core.series.Series

In [54]:
go = a[2].values.astype(float)